Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ecs-fargate.aws_appautoscaling_policy.scale_down_policy will be created
+ resource "aws_appautoscaling_policy" "scale_down_policy" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "forge-test-scale-down-policy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/forge-test/forge-test-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # module.ecs-fargate.aws_appautoscaling_policy.scale_up_policy will be created
+ resource "aws_appautoscaling_policy" "scale_up_policy" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "forge-test-scale-up-policy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/forge-test/forge-test-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 1
            }
        }
    }

  # module.ecs-fargate.aws_appautoscaling_target.scale_target will be created
+ resource "aws_appautoscaling_target" "scale_target" {
      + id                 = (known after apply)
      + max_capacity       = 5
      + min_capacity       = 1
      + resource_id        = "service/forge-test/forge-test-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.ecs-fargate.aws_cloudwatch_metric_alarm.cpu_high will be created
+ resource "aws_cloudwatch_metric_alarm" "cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "forge-test-cpu-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "forge-test"
          + "ServiceName" = "forge-test-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Maximum"
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # module.ecs-fargate.aws_cloudwatch_metric_alarm.cpu_low will be created
+ resource "aws_cloudwatch_metric_alarm" "cpu_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "forge-test-cpu-low"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "forge-test"
          + "ServiceName" = "forge-test-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + threshold                             = 10
      + treat_missing_data                    = "missing"
    }

  # module.ecs-fargate.aws_ecs_cluster.cluster will be created
+ resource "aws_ecs_cluster" "cluster" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "forge-test"
    }

  # module.ecs-fargate.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "forge-test-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)

      + load_balancer {
          + container_name   = "forge-test-sonar"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + placement_strategy {
          + field = (known after apply)
          + type  = (known after apply)
        }
    }

  # module.ecs-fargate.aws_ecs_task_definition.td will be created
+ resource "aws_ecs_task_definition" "td" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command                = null
                  + cpu                    = 1024
                  + dependsOn              = null
                  + dnsServers             = null
                  + entryPoint             = null
                  + environment            = [
                      + {
                          + name  = "forge_test"
                          + value = "dave"
                        },
                    ]
                  + essential              = true
                  + healthCheck            = null
                  + image                  = "scottyc/webapp:latest"
                  + links                  = null
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/service/forge-test"
                          + awslogs-region        = "us-west-2"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory                 = 4096
                  + memoryReservation      = 2048
                  + mountPoints            = null
                  + name                   = "forge-test-sonar"
                  + portMappings           = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                          + protocol      = "HTTP"
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + repositoryCredentials  = null
                  + secrets                = null
                  + stopTimeout            = 30
                  + ulimits                = null
                  + user                   = null
                  + volumesFrom            = null
                  + workingDirectory       = null
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "forge-test-td"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # module.ecs-fargate.aws_iam_role.ecs_autoscale_role will be created
+ resource "aws_iam_role" "ecs_autoscale_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "application-autoscaling.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "forge-test-ecs-autoscale-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.ecs-fargate.aws_iam_role.ecs_task_execution_role will be created
+ resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "forge-test-ecs-task-execution-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.ecs-fargate.aws_iam_role_policy.ecs_autoscale_role_policy will be created
+ resource "aws_iam_role_policy" "ecs_autoscale_role_policy" {
      + id     = (known after apply)
      + name   = "forge-test-ecs-autoscale-role-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecs:DescribeServices",
                          + "ecs:UpdateService",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:DescribeAlarms",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.ecs-fargate.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_attach will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "forge-test-ecs-task-execution-role"
    }

  # module.ecs-fargate.aws_kms_key.encryption_key will be created
+ resource "aws_kms_key" "encryption_key" {
      + arn                 = (known after apply)
      + description         = "forge-test ECS Encryption Key"
      + enable_key_rotation = true
      + id                  = (known after apply)
      + is_enabled          = true
      + key_id              = (known after apply)
      + key_usage           = (known after apply)
      + policy              = (known after apply)
    }

  # module.ecs-fargate.aws_lb.lb will be created
+ resource "aws_lb" "lb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "forge-test-lb"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Name" = "forge-test-lb"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }
    }

  # module.ecs-fargate.aws_lb_listener.listener will be created
+ resource "aws_lb_listener" "listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.ecs-fargate.aws_lb_target_group.lb_tg will be created
+ resource "aws_lb_target_group" "lb_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + name                               = "forge-test-lb-tg"
      + port                               = 3000
      + protocol                           = "HTTP"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "forge-test-lb-tg"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "3000"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.ecs-fargate.aws_security_group.ecs_tasks_sg will be created
+ resource "aws_security_group" "ecs_tasks_sg" {
      + arn                    = (known after apply)
      + description            = "Allow inbound access from the LB only"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3000
            },
        ]
      + name                   = "forge-test-ecs-tasks-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "forge-test-ecs-tasks-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs-fargate.aws_security_group.lb_sg will be created
+ resource "aws_security_group" "lb_sg" {
      + arn                    = (known after apply)
      + description            = "Control access to LB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "forge-test-lb-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "forge-test-lb-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_eip.nat_eip[0] will be created
+ resource "aws_eip" "nat_eip" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "Name" = "base-nat-eip-us-west-2a"
        }
      + vpc               = true
    }

  # module.networking.aws_eip.nat_eip[1] will be created
+ resource "aws_eip" "nat_eip" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "Name" = "base-nat-eip-us-west-2b"
        }
      + vpc               = true
    }

  # module.networking.aws_eip.nat_eip[2] will be created
+ resource "aws_eip" "nat_eip" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "Name" = "base-nat-eip-us-west-2c"
        }
      + vpc               = true
    }

  # module.networking.aws_eip.nat_eip[3] will be created
+ resource "aws_eip" "nat_eip" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "Name" = "base-nat-eip-us-west-2d"
        }
      + vpc               = true
    }

  # module.networking.aws_internet_gateway.internet_gw will be created
+ resource "aws_internet_gateway" "internet_gw" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "base-internet-gw"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_nat_gateway.nat_gw[0] will be created
+ resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "base-nat-gw-us-west-2a"
        }
    }

  # module.networking.aws_nat_gateway.nat_gw[1] will be created
+ resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "base-nat-gw-us-west-2b"
        }
    }

  # module.networking.aws_nat_gateway.nat_gw[2] will be created
+ resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "base-nat-gw-us-west-2c"
        }
    }

  # module.networking.aws_nat_gateway.nat_gw[3] will be created
+ resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "base-nat-gw-us-west-2d"
        }
    }

  # module.networking.aws_route.private_internet_route[0] will be created
+ resource "aws_route" "private_internet_route" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.networking.aws_route.private_internet_route[1] will be created
+ resource "aws_route" "private_internet_route" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.networking.aws_route.private_internet_route[2] will be created
+ resource "aws_route" "private_internet_route" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.networking.aws_route.private_internet_route[3] will be created
+ resource "aws_route" "private_internet_route" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.networking.aws_route.public_internet_route[0] will be created
+ resource "aws_route" "public_internet_route" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.networking.aws_route.public_internet_route[1] will be created
+ resource "aws_route" "public_internet_route" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.networking.aws_route.public_internet_route[2] will be created
+ resource "aws_route" "public_internet_route" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.networking.aws_route.public_internet_route[3] will be created
+ resource "aws_route" "public_internet_route" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.networking.aws_route_table.private_subnets_route_table[0] will be created
+ resource "aws_route_table" "private_subnets_route_table" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "base-private-rt-us-west-2a"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.private_subnets_route_table[1] will be created
+ resource "aws_route_table" "private_subnets_route_table" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "base-private-rt-us-west-2b"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.private_subnets_route_table[2] will be created
+ resource "aws_route_table" "private_subnets_route_table" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "base-private-rt-us-west-2c"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.private_subnets_route_table[3] will be created
+ resource "aws_route_table" "private_subnets_route_table" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "base-private-rt-us-west-2d"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.public_subnets_route_table[0] will be created
+ resource "aws_route_table" "public_subnets_route_table" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "base-public-rt-us-west-2a"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.public_subnets_route_table[1] will be created
+ resource "aws_route_table" "public_subnets_route_table" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "base-public-rt-us-west-2b"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.public_subnets_route_table[2] will be created
+ resource "aws_route_table" "public_subnets_route_table" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "base-public-rt-us-west-2c"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.public_subnets_route_table[3] will be created
+ resource "aws_route_table" "public_subnets_route_table" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "base-public-rt-us-west-2d"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.private_internet_route_table_associations[0] will be created
+ resource "aws_route_table_association" "private_internet_route_table_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_internet_route_table_associations[1] will be created
+ resource "aws_route_table_association" "private_internet_route_table_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_internet_route_table_associations[2] will be created
+ resource "aws_route_table_association" "private_internet_route_table_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_internet_route_table_associations[3] will be created
+ resource "aws_route_table_association" "private_internet_route_table_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_internet_route_table_associations[0] will be created
+ resource "aws_route_table_association" "public_internet_route_table_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_internet_route_table_associations[1] will be created
+ resource "aws_route_table_association" "public_internet_route_table_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_internet_route_table_associations[2] will be created
+ resource "aws_route_table_association" "public_internet_route_table_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_internet_route_table_associations[3] will be created
+ resource "aws_route_table_association" "public_internet_route_table_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_subnet.private_subnets[0] will be created
+ resource "aws_subnet" "private_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.128.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "base-private-net-us-west-2a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.private_subnets[1] will be created
+ resource "aws_subnet" "private_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.160.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "base-private-net-us-west-2b"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.private_subnets[2] will be created
+ resource "aws_subnet" "private_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.192.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "base-private-net-us-west-2c"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.private_subnets[3] will be created
+ resource "aws_subnet" "private_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2d"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.224.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "base-private-net-us-west-2d"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.public_subnets[0] will be created
+ resource "aws_subnet" "public_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.0.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "base-public-net-us-west-2a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.public_subnets[1] will be created
+ resource "aws_subnet" "public_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.32.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "base-public-net-us-west-2b"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.public_subnets[2] will be created
+ resource "aws_subnet" "public_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.64.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "base-public-net-us-west-2c"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_subnet.public_subnets[3] will be created
+ resource "aws_subnet" "public_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-west-2d"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.96.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "base-public-net-us-west-2d"
        }
      + vpc_id                          = (known after apply)
    }

  # module.networking.aws_vpc.vpc will be created
+ resource "aws_vpc" "vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "192.168.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "base-vpc"
        }
    }

  # module.ecs-fargate.module.aws_cw_logs.aws_cloudwatch_log_group.log_group will be created
+ resource "aws_cloudwatch_log_group" "log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/service/forge-test"
      + retention_in_days = 30
    }

  # module.ecs-fargate.module.aws_cw_logs.aws_cloudwatch_log_stream.log_stream will be created
+ resource "aws_cloudwatch_log_stream" "log_stream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "/ecs/service/forge-test"
      + name           = "/ecs/service/forge-test"
    }

Plan: 62 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://49d9513b3d0c:4141/lock?id=davejrt%252Fforge-fargate%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
